vwitti/stm32n6_demo_psram/submodules/STM32CubeN6_V1.2.0/Projects/NUCLEO-N657X0-Q/Examples/RAMCFG/RAMCFG_ECC_Error_Generation/FSBL/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __ICCARM__ )
#  define CMSE_NS_CALL  __cmse_nonsecure_call
#  define CMSE_NS_ENTRY __cmse_nonsecure_entry
#else
#  define CMSE_NS_CALL  __attribute((cmse_nonsecure_call))
#  define CMSE_NS_ENTRY __attribute((cmse_nonsecure_entry))
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32n6xx_nucleo.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* Function pointer declaration in non-secure*/
#if defined ( __ICCARM__ )
typedef void (CMSE_NS_CALL *funcptr)(void);
#else
typedef void CMSE_NS_CALL (*funcptr)(void);
#endif

/* typedef for non-secure callback functions */
typedef funcptr funcptr_NS;

/* USER CODE BEGIN ET */
typedef enum {MATCH = 0, NOTMATCH = !MATCH} BufferContentStatus;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
#define BKPSRAM_SINGLE_ERROR_ADDRESS_BASE (BKPSRAM_BASE_S)
#define BKPSRAM_SINGLE_ERROR_ADDRESS_SIZE (0x200U / 0x04U)
#define BKPSRAM_DOUBLE_ERROR_ADDRESS_BASE (BKPSRAM_BASE_S + 0x200U)
#define BKPSRAM_DOUBLE_ERROR_ADDRESS_SIZE (0x200U / 0x04U)

#define DATA_VALUE                      (0xAA55AA55UL)
#define SINGLE_ERROR_DATA_VALUE         (0xAA55AA54UL)
#define DOUBLE_ERROR_DATA_VALUE         (0xAA55AA50UL)

#define EXPECTED_SINGLE_ERROR_NUM       BKPSRAM_SINGLE_ERROR_ADDRESS_SIZE
#define EXPECTED_DOUBLE_ERROR_NUM       BKPSRAM_DOUBLE_ERROR_ADDRESS_SIZE
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
